app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "Mel butter and sugar"], ["updated_at", "2019-02-10 12:38:27.916644"], ["id", 17]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(params.require(:post))